# Enforce data consistency with attribute constraints

## Types of database constraints

B. SQL aggregate functions

## Conforming with data types

In [0]:
-- Let's add a record to the table
INSERT INTO transactions (transaction_date, amount, fee) 
VALUES ('2018-09-24', 5454, '30');

-- Doublecheck the contents
SELECT *
FROM transactions;

## Type CASTs

In [0]:
-- Calculate the net amount as amount + fee
SELECT transaction_date, amount + CAST(fee as integer) AS net_amount 
FROM transactions;

## Change types with ALTER COLUMN

In [0]:
-- Select the university_shortname column
SELECT DISTINCT(university_shortname) 
FROM professors;

In [0]:
-- Specify the correct fixed-length character type
ALTER TABLE professors
ALTER COLUMN university_shortname
TYPE char(3);

In [0]:
-- Change the type of firstname
ALTER TABLE professors
ALTER COLUMN firstname
TYPE varchar(64);

## Convert types USING a function

In [0]:
-- Convert the values in firstname to a max. of 16 characters
ALTER TABLE professors
ALTER COLUMN firstname
TYPE varchar(16)
USING SUBSTRING(firstname FROM 1 FOR 16);

## Disallow NULL values with SET NOT NULL

In [0]:
-- Disallow NULL values in firstname
ALTER TABLE professors
ALTER COLUMN firstname
SET NOT NULL;

In [0]:
-- Disallow NULL values in lastname
ALTER TABLE professors
ALTER COLUMN lastname
SET NOT NULL;

## What happens if you try to enter NULLs?

B. Because a database constraint is violated.

## Make your columns UNIQUE with ADD CONSTRAINT

In [0]:
-- Make universities.university_shortname unique
ALTER TABLE universities
ADD CONSTRAINT university_shortname_unq UNIQUE(university_shortname);

In [0]:
-- Make organizations.organization unique
ALTER TABLE organizations
ADD CONSTRAINT organization_unq UNIQUE(organization);